In [1]:
import pandas as pd

In [2]:
df = pd.read_html('http://sos.ga.gov/elections/election_results/2012_0306/0005002.htm')

In [3]:
df = df[2]

In [4]:
df.shape

(162, 6)

In [5]:
df.head(5)

          0     1               2                3   4   5
0       NaN   NaN  Obama  139,273  Totals  139,273 NaN NaN
1       NaN   NaN          100.0%           100.0% NaN NaN
2    County   PPR             NaN              NaN NaN NaN
3   APPLING  100%             283              283 NaN NaN
4  ATKINSON  100%              52               52 NaN NaN

In [6]:
df = df[3:]

In [7]:
df.head()

          0     1    2    3   4   5
3   APPLING  100%  283  283 NaN NaN
4  ATKINSON  100%   52   52 NaN NaN
5     BACON  100%   67   67 NaN NaN
6     BAKER  100%   58   58 NaN NaN
7   BALDWIN  100%  549  549 NaN NaN

In [8]:
df = df[df.columns[[0,2]]]

In [9]:
df.head()

          0    2
3   APPLING  283
4  ATKINSON   52
5     BACON   67
6     BAKER   58
7   BALDWIN  549

In [10]:
# df.columns = [
#     'county',
#     'Michele Bachmann',
#     'Newt Gingrich',
#     'Jon Huntsman Jr',
#     'Gary Johnson',
#     'Ron Paul',
#     'Rick Perry',
#     'Buddy Roemer',
#     'Mitt Romney',
#     'Rick Santorum'
# ]
df.columns = ['county', 'Barack Obama']

In [11]:
df.head(5)

     county Barack Obama
3   APPLING          283
4  ATKINSON           52
5     BACON           67
6     BAKER           58
7   BALDWIN          549

In [12]:
df.tail(5)

        county Barack Obama
157  WHITFIELD          274
158     WILCOX           36
159     WILKES          280
160  WILKINSON          230
161      WORTH          147

In [13]:
df = df.melt(id_vars=['county'])

In [14]:
df.columns = ['county', 'candidate', 'votes']

In [15]:
df.head()

     county     candidate votes
0   APPLING  Barack Obama   283
1  ATKINSON  Barack Obama    52
2     BACON  Barack Obama    67
3     BAKER  Barack Obama    58
4   BALDWIN  Barack Obama   549

In [16]:
df['votes'] = df['votes'].astype(int)

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 159 entries, 0 to 158
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   county     159 non-null    object
 1   candidate  159 non-null    object
 2   votes      159 non-null    int64
dtypes: int64(1), object(2)
memory usage: 3.9+ KB

In [18]:
df['office'] = 'President'

In [19]:
df['district'] = ''

In [20]:
# df['party'] = 'Republican'
df['party'] = 'Democrat'

In [21]:
df.groupby(['candidate', 'party'])['votes'].sum()

candidate     party
Barack Obama  Democrat    139273
Name: votes, dtype: int64

In [22]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].head()

     county     office district     party     candidate  votes
0   APPLING  President           Democrat  Barack Obama    283
1  ATKINSON  President           Democrat  Barack Obama     52
2     BACON  President           Democrat  Barack Obama     67
3     BAKER  President           Democrat  Barack Obama     58
4   BALDWIN  President           Democrat  Barack Obama    549

In [23]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].to_clipboard(index=False, sep=',')